# -*- coding:utf-8 -*-
# print(--------------------------------------input------------------------------------------------)
# hig = float(input("请输入身高（M）："))
# wig = float(input("请输入体重（kg）："))
# mdi = hig/(wig*wig)
# print("您的指数为:",mdi)
# if(mdi >1):
#     print("111111111")
#     if(1>=mdi>0.7):
#         print("2222222222")
# else:
#     print("3333333333")

# print(--------------------------------------if    elif    else------------------------------------------------)
# a = int(input("请输入一个小于等于100大于等于0得值："))
# if(a<0):
#     print("您输入的值太小了")
# elif(a>100):
#     print("您输入的值太大了")
# else:
#     b = 0
#     sum = 0

# print(--------------------------------------while------------------------------------------------)
#     while(b<a):
#         b = b + 1
#         sum = sum + b
#     print(sum)
# sum1 = 0

# print(--------------------------------------for------------------------------------------------)
# for i in range(1,11,2):
#     sum1 = sum1+i
#     print(sum1,i)

# print(--------------------------------------break------------------------------------------------)
# for x in range (1000):
#     if x % 3 ==2 and x % 5 ==3 and x % 7 ==2:
#         print(x)
#         # break

# print(--------------------------------------continue------------------------------------------------)
# total = 0     # 用于保存累加和的变量
# for number in range(1,100):
#     if number%2 == 1:   # 判断是否符合条件
#         continue        # 继续下一次循环，跳出循环
#     total += number     # 累加偶数的和
# print("1到100之间（不包括100）的偶数和为：",total)   # 输出累加结果






