# 算术运算：+ - * /
# 比较运算：> >= < <= == !=
# 逻辑运算：& | !
# 位运算： & | ^ ~
# 身份运算


# print("-------------------------------------------------算数运算符--------------------------------------------")
# print(5+3)                   # 加法
# print(6-4)                   # 减法
# print(4*8)                   # 乘法
# print(8/3)                   # 除法
# print(8//3)                  # 整除
# print(8%3)                   # 求余数
# print(5 ** 3)                # 乘方
# print("abcdefg" *5)          # 字符串拼接
# print(-3)                    #
# print("abcdefg" + "abc")     # 字符串拼接
# print("-------------------------------------------------逻辑运算符--------------------------------------------")
# print(True and True)
# print(True and False)
# print(True or True)
# print(True or False)
# print(not False)

# print("-------------------------------------------------比较运算符--------------------------------------------")
# print(3 > 2)
# print(3 >= 2)
# print(3 < 2)
# print(3 <= 2)
# print(3 != 2)
# print(3 == 2)

# print("-------------------------------------------------赋值运算符--------------------------------------------")
# a = 9
# print(a)
# a += 2
# print(a)
# a -= 2
# print(a)
# a *= 2
# print(a)
# a /= 2
# print(a)
# a //= 2
# print(a)
# a **= 2
# print(a)

# print("---------------------------------------------------位运算符--------------------------------------------")
# a = 60
# b = 13
# print(a & b)
# print(a | b)
# print(~a)
# print(a ^ b)
# print(a >> 1)                # 右移一位=除以二
# print(a >> 2)                # 右移两位=除以二在除以二
# print(a << 1)                # 左移一位=乘以二
# print(a << 2)                # 左移两位=乘以二在乘以二
# print(bin(a))                # 转换二进制bin（）
# &:二进制求余:都为1等于1
#                 111100
#                 001101
#                 001100
# |:二进制求或:有则1等于1
#                 111100
#                 001101
#                 111101
# ~:二进制求反:
# ^:二进制异或:相同为0不同为1
#                 111100
#                 001101
#                 110001

# a = 12
# print((a << 3) - 12)


# print("------------------------------------------------身份运算符--------------------------------------------")
# a = 'hello'
# print('h' in a )
# print('a' in a )
# print('h' not in a )
# print('a' not in a )
# # 检验某数值是否在/不在参数中，返回true/false

# li = ["苍老师", "东京热", "武藤兰", "波多野结衣"]
# content = '你知道苍老师，波老师，东京热吗？'
# for i in li:
#     if i in content:
#         content = content.replace(i, '*' * len(i))
# print(content)

x=10
print("x=",x)